window.QuranApp = window.QuranApp || {};

window.QuranApp.CONFIG = {
    API_URL: "https://script.google.com/macros/s/AKfycbz55yh9AfuAXdVI5dR1FhbEfq2eyFzczvsozUnda86-ps-PwMQW7Yg0xFGxQjvA-uZ9/exec",
    TOTAL_SURAHS: {
        "المنهج": 32,
        "جزء عم": 37,
        "جزء تبارك": 11
    },
    SURAHS_LIST: {
        "المنهج": ["الفاتحة", "الانشقاق", "البروج", "الطارق", "الأعلى", "الغاشية", "الفجر", "البلد", "الشمس", "الليل", "الضحى", "الشرح", "التين", "العلق", "القدر", "البينة", "الزلزلة", "العاديات", "القارعة", "التكاثر", "العصر", "الهمزة", "الفيل", "قريش", "الماعون", "الكوثر", "الكافرون", "النصر", "المسد", "الإخلاص", "الفلق", "الناس"],
        "جزء عم": ["النبأ", "النازعات", "عبس", "التكوير", "الانفطار", "المطففين", "الانشقاق", "البروج", "الطارق", "الأعلى", "الغاشية", "الفجر", "البلد", "الشمس", "الليل", "الضحى", "الشرح", "التين", "العلق", "القدر", "البينة", "الزلزلة", "العاديات", "القارعة", "التكاثر", "العصر", "الهمزة", "الفيل", "قريش", "الماعون", "الكوثر", "الكافرون", "النصر", "المسد", "الإخلاص", "الفلق", "الناس"],
        "جزء تبارك": ["الملك", "القلم", "الحاقة", "المعارج", "نوح", "الجن", "المزمل", "المدثر", "القيامة", "الإنسان", "المرسلات"]
    }
};
